import React from 'react';
import HakimovTitle from "../../../UI/HakimovTitle/HakimovTitle";
import cl from "./AboutOriginsBlock.module.css";
import HakimovMediumP from "../../../UI/HakimovMediumP/HakimovMediumP";
import HakimovP from "../../../UI/HakimovP/HakimovP";
import img5 from "../../../Assets/biography/img-biography-5.webp";
import img6 from "../../../Assets/biography/img-biography-6.webp";
import HakimovBlock from "../../../UI/HakimovBlock/HakimovBlock";

const SpiritualPracticeBlock = () => {
    return (
        <HakimovBlock>
            <HakimovTitle title={'Начало духовной практики'}/>
            <div className={cl.row}>
                <div className={cl.col1}>
                    <HakimovMediumP>
                        Закрыв дверь и оставшись один, я достал листок с мантрами, взял колокольчик в правую руку, встал
                        на колени (первый раз в жизни!) и головой уперся в пол. Пытаясь произнести непонятные слова на
                        санскрите, я думал: "Боже мой, до чего надо дойти, чтобы оказаться в таком положении!? Что со
                        мной?
                    </HakimovMediumP>
                    <HakimovP className={cl.full}>
                        Приятного парня звали Анантаачария. Он попросил меня повязать косынку на мою волосатую голову,
                        сполоснуть рот и помыть ноги и руки. На кухне я увидел большую медную ступку и огромное, как мне
                        показалось, разнообразие специй. Анантаачария объяснял мне свойства каждой: "Это асафетида -
                        кристаллический сок растений, заменитель лука и чеснока в благости. Это корень куркумы, она
                        очищает кровь. Перец чилли, обжаренный в топлёном масле, разжигает огонь пищеварения. Будешь
                        чистить овощи и толочь специи, но учти: ничего не нюхать и не пробовать, руками лица не
                        касаться, потому что мы будем готовить для Кришны". Он надел специальную одежду, и мы приступили
                        к этому важному делу. Действительно, Анантаачария ничего не пробовал, даже когда что-то солил. А
                        самое странное, что он мог совсем ничего не нюхать. Мне казалось, что он вообще был не на кухне,
                        а в каком-то клубе весёлых и находчивых. За час мы приготовили несколько блюд из риса и овощей.
                        "Теперь самое главное", - сказал он, и я насторожился. "Нужно предложить всё это Кришне". Я не
                        знал, что мне делать и смотрел на него, а он спокойно взял поднос с приготовленными блюдами,
                        принёс его в комнату, поставил перед изображением своего (как он сказал) гуру и, звеня
                        колокольчиком, упал в поклоне. "Бу-бу-бу-бу-бу..." - Анантаачария громко читал какие-то мантры,
                        а я стоял, как столб. На поклоны мне было трудно смотреть. Даже в церквях я не мог понять, зачем
                        люди так унижают себя. Но здесь присутствовал звук мантр, и, я бы сказал, он был жизнерадостным,
                        а точнее, даже жизнеутрерждающим. "Бу-бу-бу-бу..." Снова нахлынул прилив любви, что это? Не
                        наркотики, но, может быть, чакры? Да, я что-то слышал о действии звука на человеческий ум.
                    </HakimovP>
                    <div className={cl.micro}>
                        <HakimovP>
                            Когда мы ели прасад, это был настоящий праздник. "Ты не можешь написать мне свои мантры?" -
                            осторожно, но настойчиво попросил я. Преданный чуть не подпрыгнул от радости и, кроме мантр
                            для предложения пищи, вручил мне ещё и цветную фотографию гуру. Я почувствовал доверие к
                            нему и рассказал о своём астральном опыте. Ответ был неожиданно для меня разумным: "Это твоё
                            тонкое материальное тело, в котором невозможно достичь духовного мира. Ты самовольно
                            выходишь из своего грубого, физического тела, и поэтому у тебя много проблем. Бог дал тебе
                            человеческое тело и разум, чтобы ты развил духовные чувства и духовное тело, в котором ты
                            увидишь Бога, не выходя из своей грубой оболочки". Впервые я осознал, что есть законы Бога,
                            которые человеку лучше не нарушать. Мои ошибки были продиктованы невежеством, поисками
                            вслепую, но теперь, кажется, у меня появился шанс обрести настоящее знание.
                            <br/>
                            Я был впечатлён и, придя домой, заявил жене, что прямо сейчас буду готовить. "Но ты же
                            никогда ничего не готовил, - искренне удивилась она, - что собираешься делать?"
                        </HakimovP>
                        <HakimovP>
                            Я хотел сказать, что смогу поджарить яичницу, но потом вспомнил, что такие вещи Кришне не
                            предлагают. "Я пожарю картошку. Ты должна повязать голову косынкой, сполоснуть рот, помыть
                            ноги и руки. Будешь мне помогать. Только ничего не пробуй и не нюхай, иначе всё осквернишь",
                            - выпалил я. Жена странно помалкивала, но полностью подчинялась. Ей было очень интересно,
                            что будет потом. А потом я взял свою плохо поджаренную и плохо посоленную картошку и пошел в
                            комнату предлагать Кришне. Мы жили в общежитии, и я, ничего не объяснив, выгнал жену в
                            коридор, сказав, что позову, когда всё будет готово.
                            <br/>
                            Закрыв дверь и оставшись один, я достал листок с мантрами, взял колокольчик в правую руку,
                            встал на колени (первый раз в жизни!) и головой уперся в пол. Пытаясь произнести непонятные
                            слова на санскрите, я думал: "Боже мой, до чего надо дойти, чтобы оказаться в таком
                            положении!? Что со мной?" И не мог взять в толк, почему я так волнуюсь, ведь в комнате
                            никого нет. Как выяснилось позже, жена подсматривала за мной в дверную щел
                        </HakimovP>
                    </div>
                </div>
                <div className={cl.col2}>
                    <div className={cl.image}>
                        <img src={img5} alt={'Первые Харинамы в Санкт-Петербурге'}/>
                        <span className={cl.description}>Первые Харинамы в Санкт-Петербурге</span>
                    </div>
                    <div className={cl.image}>
                        <img src={img6} alt={'С семьёй и духовным учителем'}/>
                        <span className={cl.description}>С семьёй и духовным учителем</span>
                    </div>
                </div>
            </div>
        </HakimovBlock>
    );
};

export default SpiritualPracticeBlock;