export const MenuInfo = [
    {
        name: 'Об авторе',
        links: ['Книги', 'Биография', 'График поездок']
    },
    {
        name: 'Каталог',
        links: ['Лекции', 'Тематические подборки', 'Статьи']
    },
    {
        name: 'Веды',
        links: ['Слушать', 'Смотреть', 'Читать', 'Купить']
    },
    {
        name: 'Веды и современность',
        links: ['Веды и современность', 'Ведическая космология', 'Ведический планетарий']
    },
    {
        name: 'Контакты',
        links: ['Связаться с нами', 'Пожертвования', 'Образовательные проекты']
    },
    {
        name: 'Медиа',
        links: ['Новости', 'Фотографии']
    }
];
